sad-zz/modify-old-IVTMS/stm32-firmware/Core/Src/main.c
/**
 * @file main.c
 * @brief STM32F103C8T6 port of RATCX1 traffic counter firmware
 *
 * Original device: dsPIC30F4011 (mikroC compiler, MPLAB IDE)
 * Target device:   STM32F103C8T6 (Blue Pill) + Air780 4G LTE + W25Q80 Flash
 * Toolchain:       STM32CubeIDE / arm-none-eabi-gcc + STM32 HAL
 *
 * ─── Pin Assignments ──────────────────────────────────────────────────
 *
 *  PA0  – ADC1_IN0   Battery voltage (VBAT)
 *  PA1  – ADC1_IN1   Solar panel voltage
 *  PA2  – TIM2_CH3   Input Capture from loop oscillator MUX output
 *  PA4  – GPIO Out   W25Q80 /CS  (SPI1 chip-select, active-low)
 *  PA5  – SPI1_SCK   W25Q80 CLK
 *  PA6  – SPI1_MISO  W25Q80 DO
 *  PA7  – SPI1_MOSI  W25Q80 DI
 *  PA8  – GPIO Out   Air780 PWRKEY (pulse HIGH ≥600ms to power on)
 *  PA9  – USART1_TX  Debug / config serial port (115200 baud)
 *  PA10 – USART1_RX
 *  PA11 – GPIO In    Air780 STATUS (HIGH = module powered on)
 *
 *  PB0  – GPIO Out   Loop MUX select A (LSB)
 *  PB1  – GPIO Out   Loop MUX select B (MSB)
 *  PB2  – GPIO Out   W25Q80 /WP  (normally HIGH = write-protect disabled)
 *  PB3  – GPIO Out   W25Q80 /HOLD (normally HIGH)
 *  PB5  – GPIO Out   onloop[0] LED indicator
 *  PB6  – GPIO Out   onloop[1] LED indicator
 *  PB7  – GPIO Out   onloop[2] LED indicator
 *  PB8  – GPIO Out   onloop[3] LED indicator
 *  PB9  – GPIO Out   connection_state LED
 *  PB10 – USART3_TX  → Air780 RXD
 *  PB11 – USART3_RX  ← Air780 TXD
 *  PB12 – GPIO Out   SD card /CS  (SPI2 chip-select, active-low)
 *  PB13 – SPI2_SCK   SD card SCK
 *  PB14 – SPI2_MISO  SD card DO  (DAT0)
 *  PB15 – SPI2_MOSI  SD card DI  (CMD)
 *
 *  PC13 – GPIO Out   System heartbeat LED (Blue Pill built-in, active-low)
 *
 * ─── External hardware ────────────────────────────────────────────────
 *  Loop oscillator: 4 inductive loops → 4:1 analogue mux (e.g. CD4052)
 *    Mux A = PB0, Mux B = PB1
 *    Mux output → PA2 (TIM2_CH3 Input Capture)
 *
 *  W25Q80 8Mbit SPI NOR Flash on SPI1 (PA4–PA7)
 *    Stores up to 128 intervals (10.7 hours) for offline recovery.
 *  SD card socket on SPI2 (PB12 /CS, PB13/14/15 SCK/MISO/MOSI)
 *    Optional secondary storage (raw blocks or FAT32 via FatFS).
 *  هر کدام از این دو که بوت شوند در runtime detect می‌شوند.
 *
 *  Air780 4G LTE module on USART3 (PB10/PB11) at 115200 baud
 *    PWRKEY = PA8, STATUS = PA11.
 *
 * ─── Clock configuration ──────────────────────────────────────────────
 *  HSE = 8 MHz crystal → PLL × 9 = 72 MHz SYSCLK
 *  AHB  = 72 MHz
 *  APB1 = 36 MHz (max for APB1) – USART3, TIM4, SPI2 here
 *  APB2 = 72 MHz – SPI1, USART1, ADC1, TIM2 here
 *
 * ─── Build notes ──────────────────────────────────────────────────────
 *  1. Create a new STM32F103C8T6 project in STM32CubeIDE
 *  2. Enable: TIM2 (CH3 IC), TIM4 (base), USART1, USART3, SPI1, SPI2,
 *     ADC1 (CH0+CH1)
 *  3. Copy Core/Src/*.c and Core/Inc/*.h to your project
 *  4. SD card optional – with FatFS فعال، Drivers/FatFS/README.md را ببینید
 *  5. Insert SIM card into Air780 module, set APN in config.h
 *  6. Build and flash with ST-Link
 */

#include "main.h"
#include "stm32f1xx_hal.h"
#include <string.h>
#include <stdio.h>

#include "config.h"
#include "variables.h"
#include "loop_detector.h"
#include "classification.h"
#include "interval.h"
#include "protocol.h"
#include "air780_tcp.h"
#include "storage.h"

/* ─── HAL peripheral handles ─────────────────────────────────────────── */
TIM_HandleTypeDef  htim2;   /* Input Capture @1MHz                        */
TIM_HandleTypeDef  htim4;   /* 1ms tick                                   */
UART_HandleTypeDef huart1;  /* Debug serial port (PA9/PA10)               */
UART_HandleTypeDef huart3;  /* Air780 4G LTE (PB10/PB11)                  */
SPI_HandleTypeDef  hspi1;   /* W25Q80 SPI NOR Flash (PA4-PA7)             */
SPI_HandleTypeDef  hspi2;   /* SD card (PB13-PB15 + PB12 /CS)             */
ADC_HandleTypeDef  hadc1;   /* Battery + solar ADC                        */

/* ─── Global variables (defined here, declared extern in variables.h) ── */
volatile uint16_t error_byte         = 0;
volatile uint16_t error_byte_last    = 0;
volatile int16_t  timer_1_sec        = 0;
volatile int32_t  milisec            = 0;
volatile uint32_t how_many_micro     = 0;
volatile int16_t  onloop[4]          = {0};
volatile int16_t  Line_Dir[2]        = {0};
volatile int16_t  timexen[2]         = {0};
volatile int32_t  timex[2]           = {0};
volatile int16_t  current_loop       = 0;
volatile int16_t  docal              = 0;
volatile int16_t  forth              = 0;
volatile int32_t  current_gap[2]     = {0};
volatile int16_t  loop_error_tmp     = 0;
volatile uint32_t capw=0, capx=0, capy=0, capz=0;
volatile uint32_t freq_mean[4]       = {0};
volatile uint32_t caldata[4]         = {0};
volatile uint32_t calsum[4]          = {0};
volatile uint16_t calpointer[4]      = {0};
volatile float    freq_help          = 0;
volatile int16_t  dev[4]             = {0};
volatile uint32_t totalv1a=0,totalv1b=0,totalv1c=0,totalv1d=0,totalv1e=0,totalv1x=0;
volatile uint32_t totalv2a=0,totalv2b=0,totalv2c=0,totalv2d=0,totalv2e=0,totalv2x=0;
volatile int32_t  l1occ=0, l2occ=0;
volatile int32_t  vbat=0, solar=0;
volatile int16_t  line1step=0, line2step=0;
volatile int32_t  T1[2]={0}, T2[2]={0}, T3[2]={0};
volatile int32_t  T2S=0;
volatile uint8_t  cal_class0=0, cal_class1=0;
volatile RTC_Time_t current_time     = {25,1,1,0,0,0}; /* default: 2025-01-01 */

char datetimesec[22] = "2025.01.01-00:00:00.0";
char interval_data[512];

int loop[4];
int MARGINTOP, MARGINBOT;
int loop_distance, loop_width;
int LIMX_val, LIMA_val, LIMB_val, LIMC_val, LIMD_val, LIMITE_val;
int DSPEED1_val, NSPEED1_val, DSPEED2_val, NSPEED2_val;
int AUTCAL_val, HMM, power_type;

uint16_t cal_interval_cnt;
uint16_t cal_timer[4];
IntervalData_t current_interval;
Vehicle_t lastvehicle;

/* ─── Private function prototypes ────────────────────────────────────── */
static void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM4_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART3_UART_Init(void);
static void MX_SPI1_Init(void);
static void MX_SPI2_Init(void);
static void MX_ADC1_Init(void);
static void load_config(void);
static void read_adc(void);
static void debug_print(const char *s);

/* ─── ADC channel read helper ────────────────────────────────────────── */
static uint32_t adc_read_channel(uint32_t channel)
{
    ADC_ChannelConfTypeDef sConfig = {0};
    sConfig.Channel      = channel;
    sConfig.Rank         = ADC_REGULAR_RANK_1;
    sConfig.SamplingTime = ADC_SAMPLETIME_55CYCLES_5;
    HAL_ADC_ConfigChannel(&hadc1, &sConfig);
    HAL_ADC_Start(&hadc1);
    HAL_ADC_PollForConversion(&hadc1, 10);
    return HAL_ADC_GetValue(&hadc1);
}

