sad-zz/modify-old-IVTMS/stm32-firmware/Core/Src/main.c
/* ─────────────────────────────────────────────────────────────────────── */
/*                                main()                                   */
/* ─────────────────────────────────────────────────────────────────────── */
int main(void)
{
    /* ── HAL + Clock init ─────────────────────────────────────────────── */
    HAL_Init();
    SystemClock_Config();

    /* ── Peripheral init ──────────────────────────────────────────────── */
    MX_GPIO_Init();
    MX_TIM2_Init();
    MX_TIM4_Init();
    MX_USART1_UART_Init();
    MX_USART3_UART_Init();
    MX_SPI1_Init();
    MX_SPI2_Init();
    MX_ADC1_Init();

    /* ── Load configuration from config.h defaults ────────────────────── */
    load_config();

    /* ── Reset interval data ──────────────────────────────────────────── */
    reset_interval_data();
    reset_interval();

    /* ── Start loop detector (TIM2 IC + TIM4 tick) ────────────────────── */
    loop_detector_init();

    debug_print("RATCX1-STM32 started\r\n");

    /* ── Calibrate loops (all loops must be free of vehicles) ─────────── */
    debug_print("Calibrating loops...\r\n");
    HAL_Delay(500);
    loop_calibrate();
    debug_print("Calibration done\r\n");

    /* ── Initialise storage (W25Q80 + SD card auto-detect) ─────────────── */
    {
        uint8_t be = storage_init();
        if (be == STORAGE_BE_NONE) {
            debug_print("Storage: no backend (neither W25Q80 nor SD)\r\n");
        } else {
            if (be & STORAGE_BE_W25Q80) debug_print("Storage: W25Q80 ready\r\n");
            if (be & STORAGE_BE_SDCARD) debug_print("Storage: SD card ready\r\n");
        }
    }

    /* ── Initialise Air780 4G LTE module ─────────────────────────────────── */
    debug_print("Air780 init...\r\n");
    if (air780_init() != 0) {
        set_error(VMN_ERR);   /* reuse error bit for modem fail */
        debug_print("Air780 init failed\r\n");
    } else {
        debug_print("Air780 ready\r\n");
    }

    /* ── Initialise protocol layer ────────────────────────────────────── */
    protocol_init();

    /* ── Initialise cal timers ────────────────────────────────────────── */
    memset(cal_timer, 0, sizeof(cal_timer));

    /* ═══════════════════════════════════════════════════════════════════ */
    /*                         MAIN LOOP                                   */
    /* ═══════════════════════════════════════════════════════════════════ */
    while (1)
    {
        /* ── Vehicle classification (set by TIM4 ISR) ─────────────────── */
        if (cal_class0 > 0) {
            cal_class(0);
            cal_class0 = 0;
        }
        if (cal_class1 > 0) {
            cal_class(1);
            cal_class1 = 0;
        }

        /* ── 1-second tasks ───────────────────────────────────────────── */
        if (timer_1_sec == 1)
        {
            timer_1_sec = 0;

            /* Heartbeat LED toggle (PC13, active-low) */
            HAL_GPIO_TogglePin(GPIOC, GPIO_PIN_13);

            /* Adaptive baseline: gradually update caldata toward current freq_mean */
            for (int i = 0; i < 4; i++) {
                cal_timer[i]++;
                if (cal_timer[i] > 30) {
                    caldata[i] = (caldata[i] + freq_mean[i]) / 2;
                }
            }

            /* Reset stale lane state machines */
            if (!onloop[0] && !onloop[1]) reset_class(0);
            if (!onloop[2] && !onloop[3]) reset_class(1);

            /* ADC readings */
            read_adc();

            /* ── 5-minute interval boundary ──────────────────────────── */
            if (current_time.second == 0 &&
                (current_time.minute % INTERVAL_PERIOD) == 0)
            {
                cal_interval();
                debug_print("Interval ready\r\n");
            }

            /* ── Error indicators on LEDs ────────────────────────────── */
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_5, onloop[0] ? GPIO_PIN_SET : GPIO_PIN_RESET);
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_6, onloop[1] ? GPIO_PIN_SET : GPIO_PIN_RESET);
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_7, onloop[2] ? GPIO_PIN_SET : GPIO_PIN_RESET);
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_8, onloop[3] ? GPIO_PIN_SET : GPIO_PIN_RESET);
            HAL_GPIO_WritePin(GPIOB, GPIO_PIN_9,
                protocol_is_connected() ? GPIO_PIN_SET : GPIO_PIN_RESET);
        }

        /* ── Protocol task (TCP communication) ───────────────────────── */
        protocol_task();

        /* ── Air780 background task (drain UART RX, process URCs) ───── */
        air780_task();
    }
}

/* ─── load_config ────────────────────────────────────────────────────── */
/**
 * Load configuration from compile-time defaults in config.h.
 * In a production build these could be loaded from Flash (emulated EEPROM)
 * via HAL_FLASH_Program() / HAL_FLASH_Read().
 */
static void load_config(void)
{
    loop[0] = LOOP0_EN;
    loop[1] = LOOP1_EN;
    loop[2] = LOOP2_EN;
    loop[3] = LOOP3_EN;

    loop_distance = LOOP_DISTANCE;
    loop_width    = LOOP_WIDTH;
    MARGINTOP     = MARGIN_TOP;
    MARGINBOT     = MARGIN_BOT;

    LIMX_val   = LIMX;
    LIMA_val   = LIMA;
    LIMB_val   = LIMB;
    LIMC_val   = LIMC;
    LIMD_val   = LIMD;
    LIMITE_val = LIMITE;

    DSPEED1_val = DSPEED1;
    NSPEED1_val = NSPEED1;
    DSPEED2_val = DSPEED2;
    NSPEED2_val = NSPEED2;

    AUTCAL_val = AUTCAL;
    power_type = POWER_TYPE;
    HMM        = 10;

    /* Ensure at least one loop is active */
    if (loop[0]+loop[1]+loop[2]+loop[3] == 0) {
        loop[0] = loop[1] = 1;
    }
}

/* ─── read_adc ───────────────────────────────────────────────────────── */
static void read_adc(void)
{
    vbat  = (int32_t)adc_read_channel(ADC_CHANNEL_0);  /* PA0 */
    solar = (int32_t)adc_read_channel(ADC_CHANNEL_1);  /* PA1 */

    /* Battery low */
    if (vbat < VBAT_LOW_ADC) set_error(LBT_ERR);
    else                      reset_error(LBT_ERR);

    /* Solar / power checks */
    if (power_type == POWER_TYPE_SOLAR) {
        if (current_time.hour > 10 && current_time.hour < 14 &&
            solar < VSOL_LOW_ADC)
            set_error(SOL_ERR);
        if (solar > VSOL_HIGH_ADC)
            reset_error(SOL_ERR);
    }
}

/* ─── debug_print ────────────────────────────────────────────────────── */
static void debug_print(const char *s)
{
    HAL_UART_Transmit(&huart1, (uint8_t *)s, (uint16_t)strlen(s), 100);
}

